src/cf/InformationRegisters/ор_РеестрЦенПроизводителейНаЖНВЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ор_РеестрЦенПроизводителейНаЖНВЛП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ор_Производители</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормаВыпускаПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВУпаковке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОптоваяНаценка</Name>
					<Comment>Оптовая наценка (не используется)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РозничнаяНаценка</Name>
					<Comment>Розничная наценка (не используется)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерВыписки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Это1СНоменклатура</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаименованиеПроизводителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаВыпускаКраткое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдРЛС</Name>
					<Comment>ID РЛС</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаРегистрацииЦены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ор_РеестрЦенПроизводителейНаЖНВЛП/Forms/ФормаСопоставленияДанных/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

// Процедура - обработчик события формы "ПриСозданииНаСервере"
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("РежимСопоставления") Тогда
		Отказ = Истина;
		ВызватьИсключение НСтр("ru= 'Самостоятельное использование формы не предусмотрено'");
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриОткрытии" формы
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьСписок();
	
	Если ТаблицаДанных.Количество() = 0 Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru= 'Незаполненных данных для сопоставления не найдено.'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура - обработчик команды "СнятьВсе"
//
&НаКлиенте
Процедура СнятьВсе(Команда)
	УстановитьФлагТаблицы(Ложь);
КонецПроцедуры

// Процедура - обработчик команды "УстановитьВсе"
//
&НаКлиенте
Процедура УстановитьВсе(Команда)
	УстановитьФлагТаблицы(Истина);
КонецПроцедуры

// Процедура - обработчик команды "ТолькоПолностьюЗаполненные"
//
&НаКлиенте
Процедура ТолькоПолностьюЗаполненные(Команда)
	
	ТолькоПолностьюЗаполненныеНаСервере();
	
КонецПроцедуры

// Процедура - обработчик команды "ВыполнитьСопоставление"
//
&НаКлиенте
Процедура ВыполнитьСопоставление(Команда)
	
	Если НЕ ПроверитьТаблицуСопоставления() Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьВопрос(
		Новый ОписаниеОповещения("ВопросВыполнитьСопоставлениеЗавершение", ЭтотОбъект),
		НСтр("ru = 'Устанавливать для номенклатур штрихкоды из реестра?'"),
		РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура обновляет список реестра
//
&НаСервере
Процедура ОбновитьСписок()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ЛОЖЬ КАК Использование,
	|	РеестрЦенНаЖНВЛП.Номенклатура,
	|	РеестрЦенНаЖНВЛП.Производитель,
	|	РеестрЦенНаЖНВЛП.Наименование,
	|	РеестрЦенНаЖНВЛП.НаименованиеПроизводителя,
	|	РеестрЦенНаЖНВЛП.ШтрихКод,
	|	РеестрЦенНаЖНВЛП.МНН,
	|	РеестрЦенНаЖНВЛП.ИдРЛС,
	|	РеестрЦенНаЖНВЛП.ДатаРегистрацииЦены,
	|	РеестрЦенНаЖНВЛП.ФормаВыпускаПолное,
	|	РеестрЦенНаЖНВЛП.Действует,
	|	РеестрЦенНаЖНВЛП.ФормаВыпускаКраткое,
	|	РеестрЦенНаЖНВЛП.КоличествоВУпаковке,
	|	РеестрЦенНаЖНВЛП.Цена,
	|	РеестрЦенНаЖНВЛП.ОптоваяНаценка,
	|	РеестрЦенНаЖНВЛП.РозничнаяНаценка,
	|	РеестрЦенНаЖНВЛП.НомерВыписки,
	|	ЕСТЬNULL(ШтрихКоды.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Владелец,
	|	ЕСТЬNULL(ШтрихКоды.ПроизводительИзСерии, ЗНАЧЕНИЕ(Справочник.ор_Производители.ПустаяСсылка)) КАК ПроизводительИзСерии
	|ИЗ
	|	РегистрСведений.ор_РеестрЦенПроизводителейНаЖНВЛП КАК РеестрЦенНаЖНВЛП
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ШтрихКоды.Номенклатура КАК Номенклатура,
	|			ШтрихКоды.Характеристика.ор_Производитель КАК ПроизводительИзСерии,
	|			ШтрихКоды.Штрихкод КАК ШтрихКод
	|		ИЗ
	|			РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихКоды
	|		ГДЕ
	|			ШтрихКоды.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК ШтрихКоды
	|		ПО (ВЫБОР
	|				КОГДА РеестрЦенНаЖНВЛП.ШтрихКод = ""~""
	|						ИЛИ РеестрЦенНаЖНВЛП.ШтрихКод = """"
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ РеестрЦенНаЖНВЛП.ШтрихКод = ШтрихКоды.ШтрихКод
	|			КОНЕЦ)
	|ГДЕ
	|	(РеестрЦенНаЖНВЛП.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ИЛИ РеестрЦенНаЖНВЛП.Производитель = ЗНАЧЕНИЕ(Справочник.ор_Производители.ПустаяСсылка))
	|	И НЕ РеестрЦенНаЖНВЛП.Это1СНоменклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеестрЦенНаЖНВЛП.Наименование");
	
	ТаблицаДанных.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Для Каждого ТекСтрока Из ТаблицаДанных Цикл
		
		Попытка
			Если ЗначениеЗаполнено(ТекСтрока.Владелец) И НЕ ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда
				ТекСтрока.Номенклатура  = ТекСтрока.Владелец;
				ТекСтрока.Использование = Истина;
			КонецЕсли;
			Если ЗначениеЗаполнено(ТекСтрока.ПроизводительИзСерии) И НЕ ЗначениеЗаполнено(ТекСтрока.Производитель) Тогда
				ТекСтрока.Производитель = ТекСтрока.ПроизводительИзСерии;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ТекСтрока.Производитель) Тогда
				НаименованиеПроизводителя = Лев(ТекСтрока.НаименованиеПроизводителя, Найти(ТекСтрока.НаименованиеПроизводителя, " - ")-1);
				НаименованиеПроизводителя = СтрЗаменить(НаименованиеПроизводителя, "ОАО", "");
				НаименованиеПроизводителя = СтрЗаменить(НаименованиеПроизводителя, "ООО", "");
				НаименованиеПроизводителя = СтрЗаменить(НаименованиеПроизводителя, "ЗАО", "");
				НаименованиеПроизводителя = СтрЗаменить(НаименованиеПроизводителя, "А.О.", "");
				
				Если Не ПустаяСтрока(СокрЛП(НаименованиеПроизводителя)) Тогда 
					Производитель = Справочники.ор_Производители.НайтиПоНаименованию(СокрЛП(НаименованиеПроизводителя));
					ТекСтрока.Производитель = Производитель;
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(ТекСтрока.Производитель) Тогда
					ТекСтрока.Производитель = ТекСтрока.Номенклатура.ор_Производитель;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ТекСтрока.Штрихкод) И НЕ ТекСтрока.Штрихкод="~" И ЗначениеЗаполнено(ТекСтрока.Владелец) Тогда
				НайденныеСтроки = ТаблицаДанных.НайтиСтроки(Новый Структура("ИдРЛС, Штрихкод, ДатаРегистрацииЦены", ТекСтрока.ИдРЛС, ТекСтрока.Штрихкод, ТекСтрока.ДатаРегистрацииЦены));
					Если НайденныеСтроки.Количество()>1 Тогда
						Для Сч = 1 По НайденныеСтроки.Количество()-1 Цикл
							ТаблицаДанных.Удалить(НайденныеСтроки[Сч]);
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура устанавливает значение флаг для всей таблицы
//
&НаСервере
Процедура УстановитьФлагТаблицы(ЗначениеФлага)
	
	Для Каждого Элемент Из ТаблицаДанных Цикл
		Элемент.Использование = ЗначениеФлага;
	КонецЦикла;
	
КонецПроцедуры

// Процедура устанавливает значение флаг для только полностью заполненных
//
&НаСервере
Процедура ТолькоПолностьюЗаполненныеНаСервере()
	
	Для Каждого Элемент Из ТаблицаДанных Цикл
		Элемент.Использование = Истина;
	КонецЦикла;
	
	НайденныеСтроки = ТаблицаДанных.НайтиСтроки(Новый Структура("Номенклатура", Справочники.Номенклатура.ПустаяСсылка()));
	Для Каждого ТекСтрока Из НайденныеСтроки Цикл
		ТекСтрока.Использование = Ложь;
	КонецЦикла;
	НайденныеСтроки = ТаблицаДанных.НайтиСтроки(Новый Структура("Производитель, Использование", Справочники.ор_Производители.ПустаяСсылка(),Истина));
	Для Каждого ТекСтрока Из НайденныеСтроки Цикл
		ТекСтрока.Использование = Ложь;
	КонецЦикла;
	
КонецПроцедуры

// Процедура выполняет сопоставление
//
&НаСервере
Функция ВыполнитьСопоставлениеНаСервере(УстанавливатьШтрихкоды=Ложь)
	
	// Получим строки с номенклатурой, которые не являются ЖНВЛП
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВнешнийИсточник.ИдРЛС КАК Идентификатор,
	|	ВнешнийИсточник.ШтрихКод КАК ШтрихКод,
	|	ВнешнийИсточник.Номенклатура КАК Ссылка
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&ВнешнийИсточник КАК ВнешнийИсточник
	|ГДЕ
	|	ВнешнийИсточник.Использование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Ссылка,
	|	Товары.Идентификатор,
	|	Товары.ШтрихКод,
	|	Номенклатура.ор_ЖНВЛС
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО Товары.Ссылка = Номенклатура.Ссылка
	|ГДЕ
	|	НЕ Номенклатура.ор_ЖНВЛС");
	
	Запрос.УстановитьПараметр("ВнешнийИсточник", ТаблицаДанных.Выгрузить());
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.Идентификатор) Тогда
				НайденныеСтроки = ТаблицаДанных.НайтиСтроки(Новый Структура("ИдРЛС", Выборка.Идентификатор));
			Иначе
				НайденныеСтроки = ТаблицаДанных.НайтиСтроки(Новый Структура("ШтрихКод", Выборка.ШтрихКод));
			КонецЕсли;
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru= 'В строке №%1 номенклатура не является ЖНВЛП.'"),
				ТаблицаДанных.Индекс(НайденныеСтроки[0])+1);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстСообщения,,
				"ТаблицаДанных["+Формат(ТаблицаДанных.Индекс(НайденныеСтроки[0]), "ЧГ=0")+"].Номенклатура");
		КонецЦикла;
		
		Возврат Ложь;
		
	КонецЕсли;
	
	// Произведем запись отмеченных строк в регистр цен ЖНВЛП.
	ОтмеченныеСтроки = ТаблицаДанных.НайтиСтроки(Новый Структура("Использование", Истина));
	Для Каждого ОтмеченнаяСтрока Из ОтмеченныеСтроки Цикл
		
		НоваяЗапись = РегистрыСведений.ор_РеестрЦенПроизводителейНаЖНВЛП.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, ОтмеченнаяСтрока);
		НоваяЗапись.Действует = Истина;
		
		Попытка
			НоваяЗапись.Записать();
			Если Не НоваяЗапись.Номенклатура.ор_ЗарегистрированВСистемеМониторингаЦен Тогда
				Попытка
					НоменклатураОбъект = НоваяЗапись.Номенклатура.ПолучитьОбъект();
					НоменклатураОбъект.ор_ЗарегистрированВСистемеМониторингаЦен = Истина;
					НоменклатураОбъект.Записать();
				Исключение
				КонецПопытки;
			КонецЕсли;
		Исключение
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru= 'Не удалось записать строку: %1 - %2'"),
				НоваяЗапись.Номенклатура,
				НоваяЗапись.Производитель);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
		
		Если УстанавливатьШтрихкоды И ЗначениеЗаполнено(НоваяЗапись.ШтрихКод) Тогда
			
			// Поищем такой штрихкод у номенклатуры.
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	*
			|ИЗ
			|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихКоды
			|ГДЕ
			|	ШтрихКоды.Номенклатура = &Номенклатура
			|	И ШтрихКоды.ШтрихКод = &Штрихкод";
			Запрос.УстановитьПараметр("Номенклатура", НоваяЗапись.Номенклатура);
			Запрос.УстановитьПараметр("Штрихкод"    , НоваяЗапись.ШтрихКод);
			РезультатЗапроса = Запрос.Выполнить();
			
			// Если штрихкода нет, то добавим его.
			Если РезультатЗапроса.Пустой() Тогда
				Попытка
					НоваяЗаписьШтрихкода = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
					НоваяЗаписьШтрихкода.Номенклатура = НоваяЗапись.Номенклатура;
					НоваяЗаписьШтрихкода.Штрихкод     = НоваяЗапись.ШтрихКод;
					НоваяЗаписьШтрихкода.Записать(Ложь);
				Исключение
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= 'Не удалось записать штрихкод %1 для номенклатуры %2'"), НоваяЗапись.ШтрихКод, НоваяЗапись.Номенклатура);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				КонецПопытки;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ПроверитьТаблицуСопоставления()
	
	НайденныеСтроки = ТаблицаДанных.НайтиСтроки(Новый Структура("Использование", Истина));
	Если НайденныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru= 'Не выбрано ни одной строки.'"));
		Возврат Ложь;
	КонецЕсли;
	
	Результат = Истина;
	
	Для Каждого ОтмеченнаяСтрока Из НайденныеСтроки Цикл
		
		ТекстСообщения = "";
		
		Если НЕ ЗначениеЗаполнено(ОтмеченнаяСтрока.Номенклатура) Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= 'В строке №%1 не заполнена номенклатура.'"), ТаблицаДанных.Индекс(ОтмеченнаяСтрока)+1);
			Поле = ".Номенклатура";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда
			Результат = Ложь;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ТаблицаДанных["+Формат(ТаблицаДанных.Индекс(ОтмеченнаяСтрока), "ЧГ=0")+"]"+Поле);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ПроверитьТаблицуСопоставления()

&НаКлиенте
Процедура ВопросВыполнитьСопоставлениеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ВыполнитьСопоставлениеНаСервере(Результат = КодВозвратаДиалога.Да) Тогда
		Модифицированность = Ложь;
		ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.ор_РеестрЦенПроизводителейНаЖНВЛП"));
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
